Router> enable
Router# configure terminal
Enter configuration commands, one per line.  End with 
CNTL/Z.
Router(config)# hostname name
name(config)# enable secret 1234-MetroPole:1234
name(config)# ip ssh version 2
name(config)# ip domain-name metropolecg.com
name(config)# username admin secret 
1234-MetroPole:1234
name(config)# crypto key generate rsa
The name for the keys will be: name.metropolecg.com
Choose the size of the key modulus in the range of 360 to 
2048 for your
 General Purpose Keys. Choosing a key modulus greater than 
512 may take
 a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be 
non-exportable...[OK]

name(config)# line console 0
name(config-line)# password 1234-MetroPole:1234
name(config-line)# login
name(config-line)# exit
name(config)# line vty 0 15
name(config-line)# transport input ssh
name(config-line)# login local
name(config-line)# exit
name(config)# service password-encryption
name(config)# banner motd #Acces aux Personnes 
Autorisees Seulement !#
name(config)# exit
name#
%SYS-5-CONFIG_I: Configured from console by console

name# copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
name#
